{
    "my-smart-control adapter settings": "Настройки адаптера для my-smart-control",
    "Target Devices": "Целевые устройства",
    "Additional Conditions": "Дополнительные условия",
    "Zones": "зон",
    "Schedules": "Расписание",
    "Please read the following": "Пожалуйста, прочитайте следующее",
    "How to start?": "Как начать?",
    "Go through all options tabs accordingly (see menu above):": "Пройдите все вкладки параметров соответственно (см. Меню выше):",
    "Options Tab": "Вкладка «Параметры»",
    "What to do": "Что делать",
    "1. TARGET DEVICES": "1. ЦЕЛЕВЫЕ УСТРОЙСТВА",
    "Enter all your devices you want to switch on/off, so like light bulbs, radio, etc.": "Введите все устройства, которые вы хотите включить / выключить, например, лампочки, радио и т. Д.",
    "<i>Optional</i>: Enter additional conditions which also have to apply, or should never apply. Like: one or more are present, today is public holiday, etc.": "<i> Необязательно </ i>: введите дополнительные условия, которые также должны применяться или никогда не должны применяться. ",
    "3. TRIGGERS": "3. ТРИГГЕРЫ",
    "Enter all your triggers, like motion sensors, wall switches, and also time specific triggers (schedules).": "Введите все свои триггеры, такие как датчики движения, настенные выключатели, а также триггеры, зависящие от времени (расписания).",
    "4. ZONES": "4. ЗОНЫ",
    "Define all your zones (like Bathroom 1st floor, Coffee Corner, etc.) and assign your triggers and devices you defined before.": "Определите все свои зоны (например, 1-й этаж ванной комнаты, кофейный уголок и т. Д.) И назначьте триггеры и устройства, которые вы определили ранее.",
    "5. SCHEDULES": "5. ГРАФИК",
    "Finally, define under which conditions the target devices should be switched once a trigger was activated.": "Наконец, определите, при каких условиях целевые устройства должны переключаться после активации триггера.",
    "Testing": "тестирование",
    "\n                                        This adapter provides test states under <code>smartcontrol.x.Test</code>. These states provide no functions or features and are just for testing of this adapter.\n                                        After first installation of an instance of this adapter, the adapter options are pre-filled with some of these states.\n                                        Start testing for example by activating a trigger state, like setting <code>smartcontrol.0.Test.trigger.Bathroom_motion</code> to <code>true</code> and check if something is triggered (based on the settings in the Schedules table etc.).\n                                        <br>The ioBroker log (ioBroker Admin &gt; Log) provides detailed information. For debugging, please set the log level of the adapter instance to &apos;debug&apos;, then you will get much more information in the log.\n                                    ": "Этот адаптер предоставляет тестовые состояния в <code> smartcontrol.x.Test </ code>. ",
    "Need help? Any issues? Feature request?": "Нужна помощь? ",
    "\n                                        <table>\n                                            <thead>\n                                            <tr>\n                                                <th class=\"translate\">Your issue</th>\n                                                <th class=\"translate\">This is what you can do</th>\n                                            </tr>\n                                            </thead>\n                                            <tbody>\n                                            <tr>\n                                                <td class=\"translate\">I have a question</td>\n                                                <td class=\"translate\">Go to ioBroker forum and ask, ideally by referencing <code>@Mic</code> so that I get a notification that you are asking. Current thread for this adapter is <a href=\"https://forum.iobroker.net/topic/33691/planung-neuer-adapter-smart-control\" target=\"_blank\">Planung neuer Adapter: Smart Control (in German)</a>. But this link may/will change and new threads will follow based on the progress of the adapter development etc.</td>\n                                            </tr>\n                                            <tr>\n                                                <td class=\"translate\">I have an error/bug</td>\n                                                <td class=\"translate\">No worries :-) This adapter is in an early development stage, so errors are likely.\n                                                    First of all: Make sure you check the ioBroker log and if there any advices or notes, check these accordingly.\n                                                    <br>If you&apos;re not sure you&apos;ve done everything right in the setup, etc., read &apos;I have a question&apos; above.\n                                                    <br>If you really have an error which is caused by this adapter, please go to <strong><a href=\"https://github.com/Mic-M/ioBroker.smartcontrol/issues\" target=\"_blank\">GitHub: Smart Control Issues</a></strong> and open a new issue. Please be descriptive, explain exactly what you were doing when the error occurred, etc. Also, set the log level of the adapter to &quot;Debug&quot;, try again to reproduce the error and post the log within code tags (<code>```</code> log comes here... <code>```</code>). ioBroker sometimes cuts off the log, therefore get the log info directly from the log file (click on &quot;Download Log&quot;).\n                                                    <br><br>@German native speakers: write in German, please. That makes communication easier for us, and non-German speaking folks can greatly follow by using Google translate.\n                                                </td>\n                                            </tr>\n                                            <tr>\n                                                <td class=\"translate\">I want a new feature</td>\n                                                <td class=\"translate\">Again, this adapter is in an early development stage, and many more features to come. Anyway, if you have any suggestions for enhancements, features, etc., please go ahead and post your enhancement request at <a href=\"https://github.com/Mic-M/ioBroker.smartcontrol/issues\" target=\"_blank\">GitHub: Smart Control Issues</a>. \n                                                    <br><br><strong>Note:</strong> If you are a native German speaker: write in German, please. That makes communication way easier for us, and non-German speaking folks can follow greatly by using Google translate.\n                                                </td>\n                                            </tr>\n\n                                        </tbody>\n                                        </table>\n                                    ": "<Таблица>\n                                            ",
    "Your issue": "Ваша проблема",
    "This is what you can do": "Это то, что вы можете сделать",
    "I have a question": "у меня есть вопрос",
    "Go to ioBroker forum and ask, ideally by referencing <code>@Mic</code> so that I get a notification that you are asking. Current thread for this adapter is <a href=\"https://forum.iobroker.net/topic/33691/planung-neuer-adapter-smart-control\" target=\"_blank\">Planung neuer Adapter: Smart Control (in German)</a>. But this link may/will change and new threads will follow based on the progress of the adapter development etc.": "Перейдите на форум ioBroker и спросите, в идеале, ссылаясь на <code> @Mic </ code>, чтобы я получил уведомление о том, что вы спрашиваете. ",
    "I have an error/bug": "У меня есть ошибка / ошибка",
    "No worries :-) This adapter is in an early development stage, so errors are likely.\n                                                    First of all: Make sure you check the ioBroker log and if there any advices or notes, check these accordingly.\n                                                    <br>If you&apos;re not sure you&apos;ve done everything right in the setup, etc., read &apos;I have a question&apos; above.\n                                                    <br>If you really have an error which is caused by this adapter, please go to <strong><a href=\"https://github.com/Mic-M/ioBroker.smartcontrol/issues\" target=\"_blank\">GitHub: Smart Control Issues</a></strong> and open a new issue. Please be descriptive, explain exactly what you were doing when the error occurred, etc. Also, set the log level of the adapter to &quot;Debug&quot;, try again to reproduce the error and post the log within code tags (<code>```</code> log comes here... <code>```</code>). ioBroker sometimes cuts off the log, therefore get the log info directly from the log file (click on &quot;Download Log&quot;).\n                                                    <br><br>@German native speakers: write in German, please. That makes communication easier for us, and non-German speaking folks can greatly follow by using Google translate.\n                                                ": "Не беспокойтесь :-) Этот адаптер находится на ранней стадии разработки, поэтому возможны ошибки.\n                                                    ",
    "I want a new feature": "Я хочу новую функцию",
    "Again, this adapter is in an early development stage, and many more features to come. Anyway, if you have any suggestions for enhancements, features, etc., please go ahead and post your enhancement request at <a href=\"https://github.com/Mic-M/ioBroker.smartcontrol/issues\" target=\"_blank\">GitHub: Smart Control Issues</a>. \n                                                    <br><br><strong>Note:</strong> If you are a native German speaker: write in German, please. That makes communication way easier for us, and non-German speaking folks can follow greatly by using Google translate.\n                                                ": "Опять же, этот адаптер находится на ранней стадии разработки, и впереди еще много возможностей. ",
    "Additional Adapter Options": "Дополнительные параметры адаптера",
    "Besides the options in each tab, you have some additional options as follows. Click to open.": "Помимо параметров на каждой вкладке, у вас есть несколько дополнительных параметров, как показано ниже. ",
    "Schedule Options": "Параметры расписания",
    "Exceed Midnight": "Превышать полночь",
    "If you have a start time of 22:00 and an end time of 02:00, then this is considered as not valid, since it would exceed midnight. By activating this option, the period is being exceeded over midnight.": "Если у вас есть время начала 22:00 и время окончания 02:00, то это считается недействительным, поскольку оно превысит полночь. ",
    "Trigger Options": "Параметры запуска",
    "Motion Sensors: Disregard optional brightness level if turn-off timer is still running": "Датчики движения: игнорируйте дополнительный уровень яркости, если таймер выключения все еще работает",
    "Falls unter &apos;3. TRIGGERS&apos; Bewegungssensoren und zugeh&#xF6;rige Helligkeits-Datenpunkte definiert sind, kann man hiermit folgendes optimieren:\n                                        <br><br>\n                                        &apos;Bri&apos; ist der oberere Schwellwert der Helligkeit, &#xFC;ber dem nicht mehr eingeschaltet wird wenn der Bewegungsmelder agiert. \n                                        Dies ist jedoch nicht praxisnah, wenn der Bewegungsmelder z.B. Lichter schaltet, denn dann werden keine wiederkehrenden Bewegungen mehr erkannt, falls Licht an und &apos;Bri&apos; h&#xF6;chstwahrscheinlich damit &#xFC;berhalb des Schwellwertes ist.\n                                        Mit Aktivierung dieser Option wird der Helligkeitsdatenpunkt ignoriert, wenn ein Bewegungsmelder ausl&#xF6;ste und der Abschalt-Timer (z.B. 2 Minuten) noch l&#xE4;uft.\n                                    ": "Водопад 3 ",
    "Disregard bri if motion sensor off-timer us running": "Не обращайте внимания на bri, если таймер выключения датчика движения у нас работает",
    "Trigger-Datenpunkte unterhalb javascript.x/0_userdata.0": "Триггер-Datenpunkte unterhalb javascript.x / 0_userdata.0",
    "&#xC4;nderungen von Datenpunkten, die unterhalb von Adapter-Instanzen sind, werden nur getriggert, wenn acknowledge (ack) = true (also States g&#xFC;ltig/best&#xE4;tigt sind). F&#xFC;r user-eigene Datenpunkte unterhalb javascript.x/0_userdata.0 kann man das hier &#xE4;ndern.": "Änderungen von Datenpunkten, die unterhalb von Adapter-Instanzen sind, werden nur getriggert, wenn Подтвердить (ack) = true (также заявляет gültig / bestätigt sind). ",
    "ack:false (ignore ack:true)": "ack: false (игнорировать ack: true)",
    "ack: true (ignore ack:false)": "ack: true (игнорировать ack: false)",
    "ack: any (true or false)": "ack: любой (истина или ложь)",
    "Disregard trigger, if last triggering of same trigger occurred less than x seconds ago": "Игнорировать триггер, если последний запуск того же триггера произошел менее x секунд назад",
    "For stability reasons, trigger state changes will be disregarded if the same trigger triggers again in less than this amount of seconds. You can change the number of seconds accordingly. Less than 2 seconds is not allowed.": "По причинам стабильности изменения состояния триггера не будут учитываться, если тот же триггер сработает снова менее чем за это количество секунд. ",
    "2 or more seconds are required": "Требуется 2 или более секунд",
    "Seconds": "секунд",
    "General Options": "Общие настройки",
    "If activated, the info log will be showing way more information.": "Если активировано, информационный журнал будет показывать больше информации.",
    "Extended Info Log": "Журнал расширенной информации",
    "\n                                        Enter all target devices you want to switch once a trigger activates and conditions in Schedules table are met.\n                                        <br>\n                                        <br><i>Why using a different states for turn on and off:</i>\n                                        <br>Typically, these are the same (like state is expecting <code>true</code>/<code>false</code>) for turning on/off, but in certain cases, \n                                        users need a different state to turn a device off. Example: <code>fully-tablet-control.0.device.tablet_bathroom.commands.screenOn</code> \n                                        versus <code>fully-tablet-control.0.device.tablet_bathroom.commands.screenOff</code>.\n                                        <br>\n                                        Also, you can add states which are not boolean (<code>true</code>/<code>false</code>) but string or number.\n                                        <br>\n                                        <br>\n                                        For each table row, this adapter adds linked states to <code>smartcontrol.x.targetDevices.xxx</code>. If you change these states, the original target state will be changed accordingly, and vice versa.\n\n                                    ": "Введите все целевые устройства, которые вы хотите переключить после активации триггера и выполнения условий в таблице расписаний.\n                                        ",
    "Column": "колонка",
    "Required": "необходимые",
    "Description": "Описание",
    "&#x2713;": "✓",
    "Yes": "да",
    "Activate/deactivate this table row. If not activated, this table row will be ignored.": "Активируйте / деактивируйте эту строку таблицы. ",
    "Device Name": "Имя устройства",
    "Enter a device name of your choice. Forbidden chars: <code>[</code> <code>]</code> <code>*</code> <code>,</code> <code>;</code> <code>&apos;</code> <code>&quot;</code> <code>`</code> <code>&lt;</code> <code>&gt;</code> <code>\\</code> <code>?</code>": "Введите имя устройства по вашему выбору. ",
    "State Path to turn on": "State Path для включения",
    "Path of a device state to turn on once a trigger activates and schedules/conditions are met.": "Путь состояния устройства для включения после активации триггера и выполнения расписаний / условий.",
    "Value:on": "Значение: на",
    "State value to be set to &apos;State Path to turn on&apos;. You can enter <code>true</code>, <code>false</code>, numbers like <code>144</code>, or strings like <code>Turn on radio</code>. Any spaces or quotation marks at beginning or end of this value will be disregarded.": "Значение состояния, которое должно быть установлено в «State Path to on». ",
    "State Path to turn off": "State Path, чтобы отключить",
    "Path of a device state to turn the device off, if a timeout is reached (like no longer a motion detected for certain number of seconds) or if state <code>smartcontrol.x.targetDevices.xxx.[Device Name]</code> is being changed.": "Путь состояния устройства для выключения устройства, если истекло время ожидания (например, больше не обнаруживается движение в течение определенного количества секунд) или если состояние <code> smartcontrol.x.targetDevices.xxx. [Имя устройства] </ code ",
    "Value: off": "Значение: выкл.",
    "State value to be set to &apos;State Path to turn off&apos;. You can enter <code>true</code>, <code>false</code>, numbers like <code>144</code>, or strings like <code>Turn on radio</code>. Any spaces or quotation marks at beginning or end of this value will be disregarded.": "Значение состояния, которое должно быть установлено в «State Path to off». ",
    "Value: on": "Значение: вкл",
    "\n                                        This is optional: Enter additional conditions which also have to apply, or should never apply. Like: one or more are present, today is public holiday, etc.\n                                    ": "Это необязательно: введите дополнительные условия, которые также должны применяться или никогда не должны применяться. ",
    "Condition Name": "Название состояния",
    "Enter a condition name of your choice.": "Введите название условия по вашему выбору.",
    "State Path to Condition": "Путь к состоянию",
    "Path of state for this condition, like &apos;javascript.0.Holiday.isHolidayToday&apos;.": "Путь состояния для этого условия, например «javascript.0.Holiday.isHolidayToday».",
    "State Value": "Государственное значение",
    "State value for &apos;State Path to Condition&apos;. You can enter <code>true</code>, <code>false</code>, numbers like <code>144</code>, or strings like <code>Friday</code>. Any spaces or quotation marks at beginning or end of this value will be disregarded.": "Значение состояния для «State Path to Condition». ",
    "Motion Sensors": "Датчики движения",
    "\n                                        Enter your motion sensors. You can optionally add a brightness state and threshold value.\n                                    ": "Введите ваши датчики движения. ",
    "Motion Sensor Name": "Имя датчика движения",
    "Enter a motion sensor name of your choice.": "Введите имя датчика движения по вашему выбору.",
    "Motion Sensor State Path": "Путь состояния датчика движения",
    "Path of the motion sensor state.": "Путь состояния датчика движения.",
    "State value for detected motion (typically this is <strong>true</strong>). You can enter <code>true</code>, <code>false</code>, numbers like <code>144</code>, or strings like <code>Motion now</code>. Any spaces or quotation marks at beginning or end of this value will be disregarded.": "Значение состояния для обнаруженного движения (обычно это <strong> true </ strong>). ",
    "Sec": "Sec",
    "After this number of seconds without detected motion, target devices will be switched off.": "После этого количества секунд без обнаружения движения целевые устройства будут отключены.",
    "Brightness State Path": "Яркость State Path",
    "No": "нет",
    "Optional: Path to a state which indicates the current brightness.": "Необязательно: путь к состоянию, которое указывает текущую яркость.",
    "Bri": "Bri",
    "Threshold value for the brightness. If current brightness of &apos;Brightness State Path&apos; is greater than this number, the motion will be disregarded.": "Пороговое значение для яркости. ",
    "Other Devices": "Другие устройства",
    "\n                                        Enter other triggers like wall switches, someone entering your home, etc. These defined items trigger the zone (turning on).\n                                    ": "Введите другие триггеры, такие как настенные выключатели, кто-то входит в ваш дом и т. Д. Эти определенные элементы активируют зону (включение).",
    "Enter a device name of your choice.": "Введите имя устройства по вашему выбору.",
    "Device State Path": "Путь к состоянию устройства",
    "Path of the device state.": "Путь состояния устройства.",
    "Once the state value of &apos;Device State Path&apos; is equal to this value, the trigger activates. You can enter <code>true</code>, <code>false</code>, numbers like <code>144</code>, or strings like <code>ABCDEF</code>. Any spaces or quotation marks at beginning or end of this value will be disregarded.": "Как только значение состояния «Device State Path» будет равно этому значению, триггер активируется. ",
    "Time Specific Triggers (Schedules)": "Временные триггеры (расписания)",
    "\n                                        These triggers activate at at the times you specify.\n                                    ": "Эти триггеры активируются в указанное вами время.",
    "Name of Time Trigger": "Название триггера времени",
    "Enter a time specific trigger name of your choice.": "Введите конкретное имя триггера по вашему выбору.",
    "Time": "Время",
    "You can enter an hour/minute string like <code>23:30</code>, or a astro name like <code>sunset</code> and you can include offset in minutes, like <code>goldenHourEnd+30</code> or <code>sunset-60</code>.\n                                                                <br>Also, you can use Cron, like <code>5 4 * * *</code>. For Cron syntax, see for example: <a style=\"text-decoration: underline\" href=\"https://crontab.guru/\" target=\"_blank\">Crontab.guru</a>.\n                                                                <br><br>For hour/minute (like <code>23:30</code>) or an astro time (like <code>sunset</code>), execution will be every day. In &quot;Schedules&quot; tables you can limit this to certain weekdays etc.\n                                            ": "Вы можете ввести строку часа / минуты, например, <code> 23:30 </ code>, или звездное имя, например, <code> sunset </ code>, и вы можете включить смещение в минутах, например, <code> goldenHourEnd + 30 </ ",
    "Select additional conditions, like &apos;Public Holiday Today&apos; etc. If you leave this empty, no additional conditions will be checked. If you add more than one condition (like &apos;Public Holiday Today&apos; + &apos;Bathroom Window is open&apos;), ALL conditions must apply so that this trigger activates.": "Выберите дополнительные условия, такие как «Государственный праздник сегодня» и т. Д. Если вы оставите это поле пустым, никакие дополнительные условия проверяться не будут. ",
    "Never if": "Никогда, если",
    "Select conditions, which should never be true, like &apos;No one at home, &apos;Bathroom Temperature below 18&#xB0;C&apos;, etc. If ANY of these &apos;never if&apos; condition is met, the trigger will not activate.": "Выберите условия, которые никогда не должны быть истинными, такие как «Никого нет дома», «Температура в ванной комнате ниже 18 ° C» и т. Д. Если ЛЮБОЕ из этих условий «никогда, если» выполнено, триггер не активируется.",
    "\n                                        Define all your zones (like Bathroom 1st floor, Coffee Corner, etc.) and assign your triggers and devices you defined before.\n                                    ": "Определите все свои зоны (например, 1-й этаж ванной комнаты, кофейный уголок и т. Д.) И назначьте триггеры и устройства, которые вы определили ранее.",
    "Zone Name": "Название зоны",
    "Enter a zone name of your choice.": "Введите название зоны по вашему выбору.",
    "Triggers": "Триггеры",
    "Select one ore more triggers to assign to this zone.": "Выберите один или несколько триггеров, чтобы назначить эту зону.",
    "Select one or more target devices to switch once a trigger activates and schedules and conditions are met.": "Выберите одно или несколько целевых устройств для переключения после активации триггера и выполнения графиков и условий.",
    "\n                                        Define under which conditions the target devices should be switched once a trigger is activated.\n                                    ": "Определите, при каких условиях целевые устройства должны переключаться после активации триггера.",
    "Zone": "зона",
    "Select a zone. You can add multiple table rows with the same zone. The adapter will check all rows if any row matches the conditions.": "Выберите зону. ",
    "Start / End": "Начать конец",
    "Once a trigger is activated, the current time must be within this period to switch the target devices. You can enter an hour/minute string like <code>23:30</code>, or a astro name like <code>sunset</code> and you can include offset in minutes, like <code>goldenHourEnd+30</code> or <code>sunset-60</code>.<br> A start time of <code>sunset</code> and End time of <code>03:00</code> (so over midnight) is also possible, if you activate &quot;Exceed Midnight&quot; on the Start tab under &apos;Schedule Options&apos;.": "После активации триггера текущее время должно быть в пределах этого периода для переключения целевых устройств. ",
    "Mon-Sun": "Пн-вс",
    "Target will be switched if these weekdays apply.": "Цель будет изменена, если эти будни применяются.",
    "Select additional conditions, like &apos;Public Holiday Today&apos; etc. If you leave this empty, no additional conditions will be checked. If you add more than one condition (like &apos;Public Holiday Today&apos; + &apos;Bathroom Window is open&apos;), ALL conditions must apply to switch target device.": "Выберите дополнительные условия, такие как «Государственный праздник сегодня» и т. Д. Если вы оставите это поле пустым, никакие дополнительные условия проверяться не будут. ",
    "Select conditions, which should never be true if an associated trigger is activated, like &apos;No one at home, &apos;Bathroom Temperature below 18&#xB0;C&apos;, etc. If ANY of these &apos;never if&apos; condition is met, no target devices will be switched.": "Выберите условия, которые никогда не должны быть истинными, если связанный триггер активирован, например «Никого нет дома», «Температура в ванной комнате ниже 18 ° C» и т. Д. Если ЛЮБОЕ из этих условий «никогда, если» выполнено, целевые устройства не будут ",
    "Start": "Начало",
    "End": "Конец",
    "Mon": "понедельник",
    "Tue": "вторник",
    "Wed": "Мы бы",
    "Thu": "четверг",
    "Fri": "пятница",
    "Sat": "Суббота",
    "Sun": "солнце",
    "Select": "Выбрать",
    "Cancel": "Отмена",
    "Some Text": "Авт <Strong>в ночь</strong> текст"
}